[{"id":153000000,"name":"Deck Master System","desc":"● At the start of the Duel, each player declares the Deck Master they would like to use. If a player possesses the declared Deck Master in their Deck, that player can pick 1 of them to be their Deck Master. Otherwise, they obtain the declared Deck Master from outside the Duel.\r\n● Both players can Special Summon their Deck Masters from outside the Duel during their respective Main Phases.\r\n● If a Deck Master(s) is used as material for a Special Summon, the monster Special Summoned becomes a Deck Master.\r\n● After a Deck Master(s) leaves the field and a player(s) does not have a Deck Master, the first monster that player Summons to their field becomes a Deck Master (their choice, if multiple).\r\n● If a player does not have a Deck Master at the end of each Phase, that player loses the Duel. If neither player has a Deck Master at the end of each Phase, it results in a DRAW.","ot":4100,"type":"SPELL - NORMAL","atk":0,"def":0,"level":0,"scale":0,"race":0,"attribute":0,"setcode":0},{"id":153000001,"name":"Blue-Eyes White Dragon (Deck Master)","desc":"[ Deck Master Effect ]\r\nFusion Monsters you control or used this card as material can attack the turn they are Fusion Summoned, ignoring the \"Battle City\" and \"Virtual World\" Rules.\r\n----------------------------------------\r\n[ Flavor Text ]\r\nThis legendary dragon is a powerful engine of destruction. Virtually invincible, very few have faced this awesome creature and lived to tell the tale.","ot":4100,"type":"MONSTER - NORMAL","atk":3000,"def":2500,"level":8,"scale":0,"race":"DRAGON","attribute":"LIGHT","setcode":0},{"id":153000002,"name":"Total Defense Shogun (Deck Master)","desc":"[ Deck Master Effect ]\r\nWhen an opponent's monster declares an attack, you can pay 1000 LP, then destroy the attacking monster.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nThis card is changed to Defense Position when it is Normal Summoned or Flip Summoned successfully. This card can attack while it is in Defense Position. If this card attacks while in Defense Position, apply the ATK of this card for damage calculation.","ot":4100,"type":"MONSTER - EFFECT","atk":1550,"def":2500,"level":6,"scale":0,"race":"WARRIOR","attribute":"DARK","setcode":0},{"id":153000003,"name":"Deepsea Warrior (Deck Master)","desc":"[ Deck Master Effect ]\r\nWhen a monster you control is targeted for an attack, you can Tribute 2 monsters, then negate the attack, and if you do, inflict damage to your opponent equal to the attacking monster's ATK.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nAs long as \"Umi\" is face-up on the field, this card is unaffected by any Spell Cards.","ot":4100,"type":"MONSTER - EFFECT","atk":1600,"def":1800,"level":5,"scale":0,"race":"WARRIOR","attribute":"WATER","setcode":0},{"id":153000004,"name":"Kuriboh (Deck Master)","desc":"[ Deck Master Effect ]\r\nWhen you would take damage, you can Special Summon this card from outside the Duel. While your Deck Master \"Kuriboh\" is on the field, you take no damage.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nDuring damage calculation, if your opponent's monster attacks (Quick Effect): You can discard this card; you take no battle damage from that battle.","ot":4100,"type":"MONSTER - EFFECT","atk":300,"def":200,"level":1,"scale":0,"race":"FIEND","attribute":"DARK","setcode":0},{"id":153000005,"name":"Nightmare Penguin (Deck Master)","desc":"[ Deck Master Effect ]\r\nAll face-up WATER monsters you control gain 200 ATK.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nAll face-up WATER monsters you control gain 200 ATK. When this card is flipped face-up: Target 1 card your opponent controls; return that target to the hand.","ot":4100,"type":"MONSTER - EFFECT","atk":900,"def":1800,"level":4,"scale":0,"race":"AQUA","attribute":"WIND","setcode":90},{"id":153000006,"name":"Dark Magician Girl (Deck Master)","desc":"[ Deck Master Effect ]\r\nOnce per turn, you can draw 1 card for each monster in your Graveyard.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nThis card gains 300 ATK for every \"Dark Magician\" or \"Magician of Black Chaos\" in either player's Graveyard.","ot":4100,"type":"MONSTER - EFFECT","atk":2000,"def":1700,"level":6,"scale":0,"race":"SPELLCASTER","attribute":"DARK","setcode":162},{"id":153000007,"name":"Flame Swordsman (Deck Master)","desc":"[ Deck Master Effect ]\r\nYou can make this card lose ATK in multiples of 100 so that it has more than 0 ATK left, and if you do, 1 Warrior monster on the field gains that lost ATK. These ATK changes last for the rest of this Duel.\r\n----------------------------------------\r\n[ Flavor Text ]\r\nWith a sword wrapped in flames, he is a strong warrior. The attack issued by his sword is very powerful!","ot":4100,"type":"MONSTER - NORMAL","atk":1800,"def":1600,"level":4,"scale":0,"race":"WARRIOR","attribute":"FIRE","setcode":0},{"id":153000008,"name":"Judge Man (Deck Master)","desc":"[ Deck Master Effect ]\r\nDuring either player's turn, you can pay 1000 LP, then banish all monsters your opponent controls, and if you do, inflict 500 damage to your opponent for each monster banished.\r\n----------------------------------------\r\n[ Flavor Text ]\r\nThis club-wielding warrior battles to the end and will never surrender.","ot":4100,"type":"MONSTER - NORMAL","atk":2200,"def":1500,"level":6,"scale":0,"race":"WARRIOR","attribute":"EARTH","setcode":0},{"id":153000009,"name":"Robotic Knight (Deck Master)","desc":"[ Deck Master Effect ]\r\nDuring either player's turn, you can discard any number of Machine-Type monster, and if you do, inflict 500 damage to your opponent for each monster discarded.\r\n----------------------------------------\r\n[ Flavor Text ]\r\nThe Commander of Machine-Types, he serves the Machine King. He is famous for the way he controls his troops.","ot":4100,"type":"MONSTER - NORMAL","atk":1600,"def":1800,"level":4,"scale":0,"race":"MACHINE","attribute":"FIRE","setcode":0},{"id":153000010,"name":"Goddess with the Third Eye (Deck Master)","desc":"[ Deck Master Effect ]\r\nYou can discard 1 Spell, then Fusion Summon 1 Fusion Monster from your Extra Deck, using monsters from your hand or field as Fusion Material.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nYou can substitute this card for any 1 Fusion Material Monster. When you do this, the other Fusion Material Monster(s) must be the correct one(s).","ot":4100,"type":"MONSTER - EFFECT","atk":1200,"def":1000,"level":4,"scale":0,"race":"FAIRY","attribute":"LIGHT","setcode":0},{"id":153000011,"name":"Strike Ninja (Deck Master)","desc":"[ Deck Master Effect ]\r\nDuring either player's turn, you can discard 2 cards, then reveal 1 Set card in the Spell & Trap Zone, and if you do, if it is a Spell/Trap and the activation timing is correct, take control of it and activate it.\r\n----------------------------------------\r\n[ Monster Effect ]\r\n(Quick Effect): You can banish 2 DARK monsters from your GY; banish this face-up card until the End Phase. You can only use this effect of \"Strike Ninja\" once per turn.","ot":4100,"type":"MONSTER - EFFECT","atk":2350,"def":2200,"level":5,"scale":0,"race":"WARRIOR","attribute":"DARK","setcode":43},{"id":153000012,"name":"Super Roboyarou (Deck Master)","desc":"[ Deck Master Effect ]\r\nAt the start of the Damage Step, if a monster you control battles a monster, you can Set 1 Spell/Trap from your hand.\r\n----------------------------------------\r\n[ Monster Effect ]\r\n\"Roboyarou\" + \"Robolady\"\r\nYou can Special Summon \"Super Robolady\" by returning this card from the field to the Extra Deck. You cannot use this effect during the same turn this monster is Special Summoned. In addition, increase the ATK of this monster by 1000 points during the Damage Step when this monster battles with a monster.","ot":4100,"type":"MONSTER - FUSION / EFFECT","atk":1200,"def":500,"level":6,"scale":0,"race":"MACHINE","attribute":"EARTH","setcode":0},{"id":153000013,"name":"Jinzo (Deck Master)","desc":"[ Deck Master Effect ]\r\nNegate all face-up Traps your opponent controls and destroy them.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nNegate the effects of all Set or face-up Traps on the field and destroy them.","ot":4100,"type":"MONSTER - EFFECT","atk":2400,"def":1500,"level":6,"scale":0,"race":"MACHINE","attribute":"DARK","setcode":0},{"id":153000014,"name":"Lord of D. (Deck Master)","desc":"[ Deck Master Effect ]\r\nYou can pay 500 LP, then Normal Summon 1 Dragon monster.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nNeither player can target Dragon monsters on the field with card effects.","ot":4100,"type":"MONSTER - EFFECT","atk":1200,"def":1100,"level":4,"scale":0,"race":"SPELLCASTER","attribute":"DARK","setcode":0},{"id":153000015,"name":"Dark Magician (Deck Master)","desc":"[ Deck Master Effect ]\r\nYou can pay 1000 LP, then activate a Spell Card used this turn.\r\n----------------------------------------\r\n[ Flavor Text ]\r\nThe ultimate wizard in terms of attack and defense.","ot":4100,"type":"MONSTER - NORMAL","atk":2500,"def":2100,"level":7,"scale":0,"race":"SPELLCASTER","attribute":"DARK","setcode":162},{"id":153000016,"name":"Kaiser Sea Horse (Deck Master)","desc":"[ Deck Master Effect ]\r\nYou can Normal Summon/Set LIGHT monsters with 1 less Tribute than required.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nThis card can be treated as 2 Tributes for the Tribute Summon of a LIGHT monster.","ot":4100,"type":"MONSTER - EFFECT","atk":1700,"def":1650,"level":4,"scale":0,"race":"SEA_SERPENT","attribute":"LIGHT","setcode":0},{"id":153000017,"name":"Shinato's Ark (Deck Master)","desc":"[ Deck Master Effect ]\r\nDuring your turn, you can apply the following Deck Master Abilities for your next 7 turns (counting the turn this ability was used as the 1st turn).\r\n● Any monster in the GY is placed inside the Ark instead.\r\n● At the start of your opponent's Battle Phase, place 1 random monster inside the Ark on your field in Defense Position for each monster your opponent controls.\r\n● During either player's turn, you can banish all monsters inside the Ark, then you gain 500 LP for each banished monster.\r\n● During your 7th turn after this ability was applied (counting the turn it was applied as the 1st turn), this Deck Master becomes \"Shinato, King of a Higher Plane (Deck Master)\".\r\n----------------------------------------\r\n[ Flavor Text ]","ot":4100,"type":"MONSTER","atk":0,"def":0,"level":8,"scale":0,"race":"FAIRY","attribute":"LIGHT","setcode":0},{"id":153000018,"name":"Shinato, King of a Higher Plane (Deck Master)","desc":"[ Deck Master Effect ]\r\nIf your opponent takes damage, you gain LP equal to the damage they took. If this card would be destroyed by a card effect, you can place this card outside the Duel instead, and if you do, you cannot Summon this card for the rest of the Duel.\r\n----------------------------------------\r\n[ Monster Effect ]\r\nWhen this card destroys an opponent's monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to half of their LP.","ot":4100,"type":"MONSTER - EFFECT","atk":3300,"def":3000,"level":8,"scale":0,"race":"FAIRY","attribute":"LIGHT","setcode":0},{"id":153999999,"name":"Virtual World","desc":"Remove this card from the Duel immediately, and if you do, if all cards you now own compose an invalid Deck, your opponent can make you lose the Duel. Otherwise, draw 1 card if this card was in your hand. If both players agree, apply the following rules.\r\n● Monsters cannot attack the turn they were Special Summoned from the Extra Deck. Divine Monsters cannot attack on the turn they are Special Summoned from the Graveyard.\r\n● Monster Cards can be Normal Summoned in face-up Defense Position.\r\n● If both players agree, apply the Deck Master System.","ot":"ANIME","type":"MISC","atk":0,"def":0,"level":0,"scale":0,"race":0,"attribute":0,"setcode":0}]