[{"id":100200202,"name":"Motor Shell","desc":"If this card is sent from the field to the GY: You can Special Summon 1 \"Engine Token\" (Machine/EARTH/Level 1/ATK 200/DEF 200) in Attack Position. You can only use this effect of \"Motor Shell\" once per turn.","ot":257,"type":"MONSTER - EFFECT","atk":1300,"def":1800,"level":4,"scale":0,"race":"MACHINE","attribute":"DARK","setcode":0},{"id":100200203,"name":"Leraje the God of Archery","desc":"When this card is Normal Summoned: You can make this card gain 100 ATK for each different Monster Type in your GY, until the end of this turn. You can target 1 other face-up monster on the field; this card cannot attack for the rest of this turn, also that monster loses DEF equal to this card's ATK, then if its DEF has been reduced to 0 as a result, destroy it. You can only use this effect of \"Leraje the God of Archery\" once per turn.","ot":257,"type":"MONSTER - EFFECT","atk":1800,"def":1600,"level":4,"scale":0,"race":"FIEND","attribute":"DARK","setcode":0},{"id":100200204,"name":"Puppet Queen","desc":"When your opponent adds a monster(s) from the Deck to their hand, except by drawing them: You can Special Summon this card from your hand. If this card is Normal or Special Summoned: You can Special Summon 1 Level 7 EARTH Warrior monster from your hand or GY, and if it is \"Puppet King\", all EARTH Warrior monsters you currently control gain 1000 ATK until the end of the next turn. You can only use this effect of \"Puppet Queen\" once per turn.","ot":257,"type":"MONSTER - EFFECT","atk":2200,"def":2500,"level":6,"scale":0,"race":"WARRIOR","attribute":"EARTH","setcode":0},{"id":100200207,"name":"Propitious Warrior Lady","desc":"When an attack is declared involving your other Warrior monster and an opponent's face-up monster: You can send this card from your hand or field to the GY; that opponent's monster loses ATK equal to its original ATK, until the end of this turn. You can banish this card from your GY, then target 1 EARTH Warrior monster in your GY; add it to your hand. You can only use each effect of \"Propitious Warrior Lady\" once per turn.","ot":"OCG","type":"MONSTER - EFFECT","atk":1000,"def":800,"level":3,"scale":0,"race":"WARRIOR","attribute":"EARTH","setcode":0},{"id":100283001,"name":"Starring Knight","desc":"2 Level 4 monsters\r\nYou can detach 1 material from this card; Special Summon 1 LIGHT monster from your hand. If this card is in your GY, except the turn it was sent there: You can target 1 Level 4 LIGHT Fairy monster you control; Special Summon this card, and if you do, attach the targeted monster to this card as material. You can only use each effect of \"Starring Knight\" once per turn.","ot":257,"type":"MONSTER - XYZ / EFFECT","atk":1900,"def":1000,"level":4,"scale":0,"race":"FAIRY","attribute":"LIGHT","setcode":0}]